note/management/agile.org
#+title: agile

* [note]

*** fail-log

    - the aim of fail-log is to let us fail quickly

*** story-map

    - the aim of story-map is to keep us aiming at our direction

*** scrum

    - scrum uses story map as this main tool
      the aim of scrum is to estimate time

* agile videos

  - The death of Agile - Allen Holub
    https://www.youtube.com/watch?v=vSnCeJEka_s

  - #NoEstimates (Allen Holub)
    https://www.youtube.com/watch?v=QVBlnCTu9Ms

    - story map [with three levels]
      story counting v.s. story points [which require estimation]

  - Jim Coplien and Bob Martin Debate TDD
    https://www.youtube.com/watch?v=KtHQGs3zFAM

    - first do not write code
      design the interfaces
      and document domain knowledge

    - type system allows one to design by contracts
      you have pre-condition, post-condition
      and invariant [in dependent type system]

  - GOTO 2017 • The Dehumanisation of Agile and Objects • James Coplien
    https://www.youtube.com/watch?v=ZrBQmIDdls4

    - oo is about mapping user's mental model to program.

    - regression test is to not re-produce old bugs
      when changing the code.

  - One Hacker Way Rational alternative of Agile - Erik Meijer
    https://www.youtube.com/watch?v=2u0sNRO-QKQ

  - Agile Product Ownership in a Nutshell
    https://www.youtube.com/watch?v=502ILHjX9EE&list=PLsVPinNyc_hr1bAjgM6IzAfmWTZVttEFe&index=4

  - Spotify Engineering Culture
