out/note/management/agile.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>note/management/agile.org</title>
</head>
<body>
<pre style="white-space: pre-wrap;">#+title: agile

* [note]

*** fail-log

    - the aim of fail-log is to let us fail quickly

*** story-map

    - the aim of story-map is to keep us aiming at our direction

*** scrum

    - scrum uses story map as its main tool
      the aim of scrum is to estimate time

* agile videos

  - The death of Agile - Allen Holub
    <a href="https://www.youtube.com/watch?v=vSnCeJEka_s">https://www.youtube.com/watch?v=vSnCeJEka_s</a>

  - #NoEstimates (Allen Holub)
    <a href="https://www.youtube.com/watch?v=QVBlnCTu9Ms">https://www.youtube.com/watch?v=QVBlnCTu9Ms</a>

    - story map [with three levels]
      story counting v.s. story points [which require estimation]

  - Jim Coplien and Bob Martin Debate TDD
    <a href="https://www.youtube.com/watch?v=KtHQGs3zFAM">https://www.youtube.com/watch?v=KtHQGs3zFAM</a>

    - first do not write code
      design the interfaces
      and document domain knowledge

    - type system allows one to design by contracts
      you have pre-condition, post-condition
      and invariant [in dependent type system]

  - GOTO 2017 • The Dehumanisation of Agile and Objects • James Coplien
    <a href="https://www.youtube.com/watch?v=ZrBQmIDdls4">https://www.youtube.com/watch?v=ZrBQmIDdls4</a>

    - oo is about mapping user&apos;s mental model to program.

    - regression test is to not re-produce old bugs
      when changing the code.

  - One Hacker Way Rational alternative of Agile - Erik Meijer
    <a href="https://www.youtube.com/watch?v=2u0sNRO-QKQ">https://www.youtube.com/watch?v=2u0sNRO-QKQ</a>

  - Agile Product Ownership in a Nutshell
    <a href="https://www.youtube.com/watch?v=502ILHjX9EE&amp;list=PLsVPinNyc_hr1bAjgM6IzAfmWTZVttEFe&amp;index=4">https://www.youtube.com/watch?v=502ILHjX9EE&amp;list=PLsVPinNyc_hr1bAjgM6IzAfmWTZVttEFe&amp;index=4</a>

  - Spotify Engineering Culture
</pre>
</body>
</html>
